{
  "projects": [
    {
      "id": 1,
      "title": "TimeFlow",
      "stack": [
        "PHP",
        "Laravel",
        "MySQL",
        "React.js",
        "CSS",
        "Vite"
      ],
      "description": "TimeFlow is a robust time management tool designed to enhance personal or small team organization and efficiency. Its advanced calendar and task handling features empower users to seize control of their schedules, effortlessly rearranging tasks for individual or team use. Say farewell to chaotic time management and welcome a more productive, stress-free lifestyle. Built using PHP, Laravel, MySQL, JavaScript, React.js, CSS, HTML, Axios, and Vite, it's an evolving platform aimed at streamlining time management with upcoming features like task customization, notifications, drag-and-drop task rearrangement, team collaboration, data analytics, and calendar integration.",
      "shortDescription": "TimeFlow - Empower your time management. This tool offers advanced calendar and task handling features", 
      "features": [
        "Task Management: Create, organize, and prioritize tasks with ease. Customize task details, set due dates, and categorize them [coming soon] for a structured workflow.",
        "Notifications and Reminders: Stay on top of your commitments with customizable notifications and reminders. Never miss an important event or deadline again. ",
        "[coming soon] Drag-and-Drop Task Rearrangement: Effortlessly rearrange your tasks in the calendar by simply dragging and dropping. Adjust your schedule on the fly to adapt to changing priorities.",
        "[coming soon] Team Collaboration: Share your schedule with team members and collaborators. Collaborative features allow teams to work together and allocate tasks efficiently.",
        "[coming soon] Data Analytics: Gain insights into your time management habits through visual analytics. Identify areas where you can improve and optimize your workflow.",
        "[coming soon] Advanced Calendar Integration: Seamlessly sync your existing calendars, such as Google Calendar, Apple Calendar, or Microsoft Outlook, to have all your events and appointments in one place."
      ],
      "thumbnail": "/timeflow/TimeFlow-logo.png",
      "images": [
        "timeflow/TimeFlow-calendarMonthly.png",
        "timeflow/TimeFlow-calendarWeekly.png",
        "timeflow/TimeFlow-calendarAgenda.png",
        "timeflow/TimeFlow-aside.png",
        "timeflow/TimeFlow-createTask.png",
        "timeflow/TimeFlow-taskInfo.png",
        "timeflow/TimeFlow-profileInfo.png"
      ],
      "video": "./videos/timeflow-demo.mp4",
      "link": "timeflow"
    },
    {
      "id": 2,
      "title": "Twitter Clone",
      "shortDescription": "A Twitter-inspired pet project created for skill practice.",
      "description": "The pet project is a Twitter clone meticulously crafted to mirror the original platform's style and functionality. It's built using PHP with the Laravel framework, employing MySQL for database management and HTML/CSS Blade for front-end development. The primary features include user authentication, the ability to follow/unfollow users, create and repost tweets, like posts, and attach images to tweets. This project serves as a practical endeavor to enhance and apply skills in web development, replicating key functionalities of a popular social media platform within a controlled environment.",
      "thumbnail": "twitter/twitter-logo.png",
      "images": [
        "twitter/twitter-0.png",
        "twitter/twitter-1.png",
        "twitter/twitter-2.png",
        "twitter/twitter-3.png",
        "twitter/twitter-4.png",
        "twitter/twitter-5.png",
        "twitter/twitter-6.png",
        "twitter/twitter-7.png"
      ],
      "video": "./videos/twitter-demo.mp4",
      "stack": [
        "PHP",
        "Laravel",
        "MySQL",
        "Blade",
        "JS",
        "CSS"
      ],
      "link": "twitter"
    }
  ],
  "about": {
    "title": "About Me",
    "description": [
      "My name is Mikita Kavaliou, and I reside in Poland. I am a dedicated junior web developer deeply passionate about coding and creating.",
      "My skill set:",
      "PHP, JavaScript, MySQL, CSS, HTML, Tailwind CSS, Laravel, React, TypeScript, and Docker. Over the past year, I've been actively developing personal projects, acquiring both practical and theoretical knowledge in the process.",
      "I've maintained an unbroken streak of daily work for an entire year, as evidenced by my consistent activity on GitHub. I thrive on tackling complex problems, believing in the 'learning by doing' approach.",
      "Some interesting facts about me:",
      "I am a languages enthusiast speaking in 5 languages, constantly learning new ones. I've devised my own language learning methods and aim to create an app based on these techniques.",
      "I strongly believe in the mind-body connection. I engage in daily sports activities like 6:30 AM morning runs, calisthenics, and breakdancing to improve my physical fitness. Additionally, I exclusively commute by cycling, foregoing public transportation.",
      "Cooking is another passion of mine. I prepare nutritionally rich meals, considering my body a temple that fuels my productivity and health.",
      "I am fascinated by neuroscience and dedicate my free time to studying my mind and body. I'm also keen on developing my understanding of stoic philosophy and integrating it into my daily life."
    ]
  }
}
